In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1={
    "name":['harry','rohan','skillf','shubh'],
    "marks":[92,56,89,99],
    "city":['rampur','mumbai','kolkata','bareily']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks     city
0   harry     92   rampur
1   rohan     56   mumbai
2  skillf     89  kolkata
3   shubh     99  bareily

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends.csv',index=False)

In [7]:
df.head(2)

    name  marks    city
0  harry     92  rampur
1  rohan     56  mumbai

In [8]:
df.tail(2)

     name  marks     city
2  skillf     89  kolkata
3   shubh     99  bareily

In [9]:
df.describe()

           marks
count   4.000000
mean   84.000000
std    19.131126
min    56.000000
25%    80.750000
50%    90.500000
75%    93.750000
max    99.000000

In [10]:
harry=pd.read_csv('train.csv')

In [11]:
harry=pd.read_csv('train.csv')

In [12]:
harry

   train  Speed     city
0     56     92   rampur
1     67     56   mumbai
2     78     89  kolkata
3     67     99  bareily

In [13]:
harry['Speed'][0]=920

c:\users\admin\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [14]:
harry

   train  Speed     city
0     56    920   rampur
1     67     56   mumbai
2     78     89  kolkata
3     67     99  bareily

In [15]:
harry.to_csv('harry.csv',index=False)

In [16]:
harry.index=['first','second','third','fourth']

In [17]:
harry

        train  Speed     city
first      56    920   rampur
second     67     56   mumbai
third      78     89  kolkata
fourth     67     99  bareily

In [18]:
harry['Speed'][0]=78

c:\users\admin\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [19]:
harry

        train  Speed     city
first      56     78   rampur
second     67     56   mumbai
third      78     89  kolkata
fourth     67     99  bareily

In [20]:
ser=pd.Series(np.random.rand(34))

In [21]:
ser

0     0.521540
1     0.216960
2     0.079463
3     0.368063
4     0.983214
5     0.128571
6     0.627830
7     0.718422
8     0.051367
9     0.525514
10    0.232942
11    0.328439
12    0.306208
13    0.261634
14    0.903756
15    0.517526
16    0.525895
17    0.769506
18    0.087480
19    0.921242
20    0.923106
21    0.743523
22    0.846708
23    0.884926
24    0.276126
25    0.078377
26    0.269997
27    0.895980
28    0.362913
29    0.857071
30    0.112911
31    0.650195
32    0.079548
33    0.077383
dtype: float64

In [22]:
type(ser)

pandas.core.series.Series

In [23]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [24]:
newdf.head()

          0         1         2         3         4
0  0.724317  0.320522  0.433164  0.316642  0.982870
1  0.102630  0.589694  0.378504  0.803453  0.202476
2  0.456092  0.524961  0.171268  0.276886  0.017517
3  0.664508  0.762541  0.109952  0.510391  0.319977
4  0.063726  0.305198  0.630290  0.884324  0.926583

In [25]:
newdf

            0         1         2         3         4
0    0.724317  0.320522  0.433164  0.316642  0.982870
1    0.102630  0.589694  0.378504  0.803453  0.202476
2    0.456092  0.524961  0.171268  0.276886  0.017517
3    0.664508  0.762541  0.109952  0.510391  0.319977
4    0.063726  0.305198  0.630290  0.884324  0.926583
..        ...       ...       ...       ...       ...
329  0.014847  0.839376  0.435666  0.784373  0.703545
330  0.321548  0.112110  0.811755  0.567168  0.031162
331  0.091001  0.816566  0.698306  0.325889  0.357432
332  0.376923  0.058118  0.978237  0.839719  0.284333
333  0.759686  0.347941  0.951700  0.000236  0.085545

[334 rows x 5 columns]

In [26]:
type(newdf)

pandas.core.frame.DataFrame

In [27]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.496978    0.498421    0.478166    0.498560    0.514148
std      0.282081    0.289175    0.283739    0.273189    0.290567
min      0.002896    0.000336    0.003587    0.000236    0.003583
25%      0.267299    0.234682    0.227555    0.269979    0.263873
50%      0.506236    0.517464    0.444217    0.489375    0.522532
75%      0.723500    0.749158    0.704504    0.746529    0.773726
max      0.996896    0.997055    0.999130    0.999386    0.997895

In [28]:
newdf.head()

          0         1         2         3         4
0  0.724317  0.320522  0.433164  0.316642  0.982870
1  0.102630  0.589694  0.378504  0.803453  0.202476
2  0.456092  0.524961  0.171268  0.276886  0.017517
3  0.664508  0.762541  0.109952  0.510391  0.319977
4  0.063726  0.305198  0.630290  0.884324  0.926583

In [29]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
newdf[0][0]='rahul'

In [31]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [32]:
newdf.head()

           0         1         2         3         4
0      rahul  0.320522  0.433164  0.316642  0.982870
1    0.10263  0.589694  0.378504  0.803453  0.202476
2   0.456092  0.524961  0.171268  0.276886  0.017517
3   0.664508  0.762541  0.109952  0.510391  0.319977
4  0.0637256  0.305198  0.630290  0.884324  0.926583

In [33]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [34]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [35]:
newdf.to_numpy()

array([['rahul', 0.3205219373622026, 0.4331639185276688,
        0.31664166231360946, 0.9828695136968578],
       [0.10263016615659626, 0.5896937490123301, 0.37850447385594843,
        0.8034527997230737, 0.20247643088571166],
       [0.4560918272321214, 0.5249611885903486, 0.1712682178490641,
        0.2768859940705418, 0.01751720364357634],
       ...,
       [0.09100062994356528, 0.8165659831326203, 0.6983061404583574,
        0.3258892401607766, 0.3574318499978576],
       [0.37692285858323815, 0.058118329097136545, 0.9782366298038443,
        0.8397193183531461, 0.28433340569818566],
       [0.7596861658501203, 0.3479414077809917, 0.9517003913171869,
        0.0002356216624652685, 0.08554522553181498]], dtype=object)

In [36]:
newdf[0][0]=0.35

c:\users\admin\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [37]:
newdf.head()

           0         1         2         3         4
0       0.35  0.320522  0.433164  0.316642  0.982870
1    0.10263  0.589694  0.378504  0.803453  0.202476
2   0.456092  0.524961  0.171268  0.276886  0.017517
3   0.664508  0.762541  0.109952  0.510391  0.319977
4  0.0637256  0.305198  0.630290  0.884324  0.926583

In [38]:
newdf.to_numpy()

array([[0.35, 0.3205219373622026, 0.4331639185276688,
        0.31664166231360946, 0.9828695136968578],
       [0.10263016615659626, 0.5896937490123301, 0.37850447385594843,
        0.8034527997230737, 0.20247643088571166],
       [0.4560918272321214, 0.5249611885903486, 0.1712682178490641,
        0.2768859940705418, 0.01751720364357634],
       ...,
       [0.09100062994356528, 0.8165659831326203, 0.6983061404583574,
        0.3258892401607766, 0.3574318499978576],
       [0.37692285858323815, 0.058118329097136545, 0.9782366298038443,
        0.8397193183531461, 0.28433340569818566],
       [0.7596861658501203, 0.3479414077809917, 0.9517003913171869,
        0.0002356216624652685, 0.08554522553181498]], dtype=object)

In [39]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.35,0.10263,0.456092,0.664508,0.0637256,0.676344,0.227969,0.532952,0.856831,0.0463939,...,0.686105,0.289276,0.907141,0.73675,0.331599,0.014847,0.321548,0.0910006,0.376923,0.759686
1,0.320522,0.589694,0.524961,0.762541,0.305198,0.458654,0.208945,0.634749,0.101563,0.387139,...,0.0737124,0.808316,0.74929,0.338144,0.351998,0.839376,0.11211,0.816566,0.0581183,0.347941
2,0.433164,0.378504,0.171268,0.109952,0.63029,0.378375,0.708914,0.425657,0.105662,0.243702,...,0.221005,0.220036,0.987806,0.866557,0.895878,0.435666,0.811755,0.698306,0.978237,0.9517
3,0.316642,0.803453,0.276886,0.510391,0.884324,0.15382,0.881001,0.9694,0.25378,0.494942,...,0.905752,0.53758,0.766228,0.819011,0.897696,0.784373,0.567168,0.325889,0.839719,0.000235622
4,0.98287,0.202476,0.0175172,0.319977,0.926583,0.505892,0.73707,0.818226,0.4967,0.0153719,...,0.946872,0.136309,0.0543874,0.774042,0.00584617,0.703545,0.0311615,0.357432,0.284333,0.0855452

In [40]:
newdf

             0         1         2         3         4
0         0.35  0.320522  0.433164  0.316642  0.982870
1      0.10263  0.589694  0.378504  0.803453  0.202476
2     0.456092  0.524961  0.171268  0.276886  0.017517
3     0.664508  0.762541  0.109952  0.510391  0.319977
4    0.0637256  0.305198  0.630290  0.884324  0.926583
..         ...       ...       ...       ...       ...
329   0.014847  0.839376  0.435666  0.784373  0.703545
330   0.321548  0.112110  0.811755  0.567168  0.031162
331  0.0910006  0.816566  0.698306  0.325889  0.357432
332   0.376923  0.058118  0.978237  0.839719  0.284333
333   0.759686  0.347941  0.951700  0.000236  0.085545

[334 rows x 5 columns]

In [41]:
newdf.sort_index(axis=0,ascending=False)

             0         1         2         3         4
333   0.759686  0.347941  0.951700  0.000236  0.085545
332   0.376923  0.058118  0.978237  0.839719  0.284333
331  0.0910006  0.816566  0.698306  0.325889  0.357432
330   0.321548  0.112110  0.811755  0.567168  0.031162
329   0.014847  0.839376  0.435666  0.784373  0.703545
..         ...       ...       ...       ...       ...
4    0.0637256  0.305198  0.630290  0.884324  0.926583
3     0.664508  0.762541  0.109952  0.510391  0.319977
2     0.456092  0.524961  0.171268  0.276886  0.017517
1      0.10263  0.589694  0.378504  0.803453  0.202476
0         0.35  0.320522  0.433164  0.316642  0.982870

[334 rows x 5 columns]

In [42]:
newdf.sort_index(axis=1,ascending=False)

            4         3         2         1          0
0    0.982870  0.316642  0.433164  0.320522       0.35
1    0.202476  0.803453  0.378504  0.589694    0.10263
2    0.017517  0.276886  0.171268  0.524961   0.456092
3    0.319977  0.510391  0.109952  0.762541   0.664508
4    0.926583  0.884324  0.630290  0.305198  0.0637256
..        ...       ...       ...       ...        ...
329  0.703545  0.784373  0.435666  0.839376   0.014847
330  0.031162  0.567168  0.811755  0.112110   0.321548
331  0.357432  0.325889  0.698306  0.816566  0.0910006
332  0.284333  0.839719  0.978237  0.058118   0.376923
333  0.085545  0.000236  0.951700  0.347941   0.759686

[334 rows x 5 columns]

In [43]:
newdf.head()

           0         1         2         3         4
0       0.35  0.320522  0.433164  0.316642  0.982870
1    0.10263  0.589694  0.378504  0.803453  0.202476
2   0.456092  0.524961  0.171268  0.276886  0.017517
3   0.664508  0.762541  0.109952  0.510391  0.319977
4  0.0637256  0.305198  0.630290  0.884324  0.926583

In [44]:
newdf[0]

0           0.35
1        0.10263
2       0.456092
3       0.664508
4      0.0637256
         ...
329     0.014847
330     0.321548
331    0.0910006
332     0.376923
333     0.759686
Name: 0, Length: 334, dtype: object

In [45]:
newdf[0][0]

0.35

In [46]:
type(newdf[0])

pandas.core.series.Series

In [47]:
type(newdf[0][0])

float

In [48]:
newdf2=newdf.copy()

In [49]:
newdf2[0][0]=97305

c:\users\admin\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [50]:
newdf

             0         1         2         3         4
0         0.35  0.320522  0.433164  0.316642  0.982870
1      0.10263  0.589694  0.378504  0.803453  0.202476
2     0.456092  0.524961  0.171268  0.276886  0.017517
3     0.664508  0.762541  0.109952  0.510391  0.319977
4    0.0637256  0.305198  0.630290  0.884324  0.926583
..         ...       ...       ...       ...       ...
329   0.014847  0.839376  0.435666  0.784373  0.703545
330   0.321548  0.112110  0.811755  0.567168  0.031162
331  0.0910006  0.816566  0.698306  0.325889  0.357432
332   0.376923  0.058118  0.978237  0.839719  0.284333
333   0.759686  0.347941  0.951700  0.000236  0.085545

[334 rows x 5 columns]

In [51]:
newdf2

             0         1         2         3         4
0        97305  0.320522  0.433164  0.316642  0.982870
1      0.10263  0.589694  0.378504  0.803453  0.202476
2     0.456092  0.524961  0.171268  0.276886  0.017517
3     0.664508  0.762541  0.109952  0.510391  0.319977
4    0.0637256  0.305198  0.630290  0.884324  0.926583
..         ...       ...       ...       ...       ...
329   0.014847  0.839376  0.435666  0.784373  0.703545
330   0.321548  0.112110  0.811755  0.567168  0.031162
331  0.0910006  0.816566  0.698306  0.325889  0.357432
332   0.376923  0.058118  0.978237  0.839719  0.284333
333   0.759686  0.347941  0.951700  0.000236  0.085545

[334 rows x 5 columns]

In [52]:
newdf.loc[0,0]=654

In [53]:
newdf.head(2)

         0         1         2         3         4
0      654  0.320522  0.433164  0.316642  0.982870
1  0.10263  0.589694  0.378504  0.803453  0.202476

In [54]:
newdf2.head()

           0         1         2         3         4
0      97305  0.320522  0.433164  0.316642  0.982870
1    0.10263  0.589694  0.378504  0.803453  0.202476
2   0.456092  0.524961  0.171268  0.276886  0.017517
3   0.664508  0.762541  0.109952  0.510391  0.319977
4  0.0637256  0.305198  0.630290  0.884324  0.926583

In [55]:
newdf.columns=list("ABCDE")

In [56]:
newdf.head()

           A         B         C         D         E
0        654  0.320522  0.433164  0.316642  0.982870
1    0.10263  0.589694  0.378504  0.803453  0.202476
2   0.456092  0.524961  0.171268  0.276886  0.017517
3   0.664508  0.762541  0.109952  0.510391  0.319977
4  0.0637256  0.305198  0.630290  0.884324  0.926583

In [57]:
newdf.loc[0,'A']=657

In [58]:
newdf.head()

           A         B         C         D         E
0        657  0.320522  0.433164  0.316642  0.982870
1    0.10263  0.589694  0.378504  0.803453  0.202476
2   0.456092  0.524961  0.171268  0.276886  0.017517
3   0.664508  0.762541  0.109952  0.510391  0.319977
4  0.0637256  0.305198  0.630290  0.884324  0.926583

In [59]:
newdf.loc[0,0]=99

In [60]:
newdf.head()

           A         B         C         D         E     0
0        657  0.320522  0.433164  0.316642  0.982870  99.0
1    0.10263  0.589694  0.378504  0.803453  0.202476   NaN
2   0.456092  0.524961  0.171268  0.276886  0.017517   NaN
3   0.664508  0.762541  0.109952  0.510391  0.319977   NaN
4  0.0637256  0.305198  0.630290  0.884324  0.926583   NaN

In [61]:
newdf=newdf.drop(0,axis=1)

In [62]:
newdf

             A         B         C         D         E
0          657  0.320522  0.433164  0.316642  0.982870
1      0.10263  0.589694  0.378504  0.803453  0.202476
2     0.456092  0.524961  0.171268  0.276886  0.017517
3     0.664508  0.762541  0.109952  0.510391  0.319977
4    0.0637256  0.305198  0.630290  0.884324  0.926583
..         ...       ...       ...       ...       ...
329   0.014847  0.839376  0.435666  0.784373  0.703545
330   0.321548  0.112110  0.811755  0.567168  0.031162
331  0.0910006  0.816566  0.698306  0.325889  0.357432
332   0.376923  0.058118  0.978237  0.839719  0.284333
333   0.759686  0.347941  0.951700  0.000236  0.085545

[334 rows x 5 columns]

In [63]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.378504  0.803453
2  0.171268  0.276886

In [64]:
newdf.loc[:,['C','D']]

            C         D
0    0.433164  0.316642
1    0.378504  0.803453
2    0.171268  0.276886
3    0.109952  0.510391
4    0.630290  0.884324
..        ...       ...
329  0.435666  0.784373
330  0.811755  0.567168
331  0.698306  0.325889
332  0.978237  0.839719
333  0.951700  0.000236

[334 rows x 2 columns]

In [65]:
newdf.loc[[0,1],:]

         A         B         C         D         E
0      657  0.320522  0.433164  0.316642  0.982870
1  0.10263  0.589694  0.378504  0.803453  0.202476

In [66]:
newdf[0]

KeyError: 0

In [1]:
newdf['A']

NameError: name 'newdf' is not defined

In [ ]:
newdf.loc[(newdf['A']<0.7) & (newdf['C']>0.3)]

In [ ]:
newdf.iloc[0,4]

In [ ]:
newdf.iloc[[0,5],[1,2]]

In [ ]:
newdf.head(3)

In [ ]:
newdf.drop(['A','D'], axis=1, inplace=True)

In [ ]:
newdf

In [ ]:
newdf.drop([0,2], axis=0, inplace=True)

In [ ]:
newdf

In [ ]:
newdf.reset_index(drop=True,inplace=True)

In [ ]:
newdf

In [ ]:
newdf['B'].isnull()

In [ ]:
newdf['B']=None

In [ ]:
newdf

In [ ]:
newdf.isnull()

In [ ]:
newdf.loc[:,['B']]=56

In [ ]:
newdf['B']

In [ ]:
newdf.head()

In [ ]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [ ]:
df.head()

In [ ]:
df.dropna()

In [ ]:
df.head()

In [ ]:
df.dropna(how='all',axis=1)

In [ ]:
df.drop_duplicates(subset='name',keep=False)

In [ ]:
df.shape

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
df['toy'].value_counts(dropna=False)

In [ ]:
df.notnull()

In [ ]:
df.isnull()

In [ ]:
ndf=pd.DataFrame(np.random.rand(3,2),index=np.arange(3))

In [ ]:
ndf

In [ ]:
ndf.describe()

In [ ]:
ndf.mean()

In [ ]:
ndf.corr()

In [ ]:
ndf.count()

In [ ]:
ndf.max()

In [ ]:
ndf.min()

In [ ]:
ndf.std

In [ ]:
ndf.mean()

In [ ]:
data=pd.read_excel('train1.xlsx')